from enum import Enum

class const_params(Enum):
    num_A = 8 * 4 # 参考点每一个点有8张照片，参考点数为4
    num_T = 8 * 4 # 测试点每一个点有8张照片，测试点数为4
    # 参考点和测试点的坐标向量
    posli = [(0,0),(0,4),(0,-2),(0,8),(-2,-2),(3,-2),(0,1),(0,7)]
    # 参考点与测试点的期望匹配值
    correctPos = [[[-2,-2],[0,-2]],[[3,-2],[0,-2]],[[0,1],[0,0]],[[0,7],[0,8]]]

class dist(Enum):
    ED = 0 # 欧式距离: np.sqrt(np.sum((gist0 - gist1)**2))
    MD = 1 # 曼哈顿距离: np.sum((gist0 - gist1)**2)
    CD1 = 2
    CD2 = 3
    MSD = 4
    HD = 5
    MKD = 6

num_A = 8 * 4
num_T = 8 * 4
posli = [(0,0),(0,4),(0,-2),(0,8),(-2,-2),(3,-2),(0,1),(0,7)]
correctPos = [[[-2,-2],[0,-2]],[[3,-2],[0,-2]],[[0,1],[0,0]],[[0,7],[0,8]]]